Repository: pypi-data/pypi-mirror-136
Catalog: packages/betik-app-staff/betik_app_staff-1.5.0.tar.gz/betik_app_staff-1.5.0/betik_app_staff/locale/*/LC_MESSAGES/django.po
Languages: tr

source: Active
tr: Aktif

source: Passive
tr: Pasif

source: Dismiss
tr: İhraç

source: Day
tr: Gün

source: Business Day
tr: Mesai Günü

source: Hour
tr: Saat

source: Week
tr: Hafta

source: Month
tr: Ay

source: Year
tr: Yıl

source: Overtime Shift
tr: Fazla Mesai

source: Weekend Shift
tr: Haftasonu Mesai

source: Holiday Shift
tr: Tatil Günü Mesai

source: Normal Shift
tr: Normal Mesai

source: Annual Leave
tr: Yıllık İzin

source: identity, tax number, name, last name
tr: kimlik no, vergi no, ad, soyad

source: %(duration_type)s duration type not found
tr: %(duration_type)s süre tipi bulunamadı

source: Working hours were not determined for the %(staff_type)s on %(date)s
tr: %(date)s tarihinde, %(staff_type)s için çalışma saatleri belirlenmemiş

source: Annual leave rule were not determined for the %(staff_type)s on %(date)s
tr: %(date)s tarihinde %(staff_type)s için yıllık izin kuralı belirlenmemiş

source: Considering the date of employment of the staff, they have not yet obtained the right to take annual leave.
tr: Personelin işe giriş tarihi dikkate alındığında, henüz yıllık izin kullanma hakkını elde edememiştir.

source: %s file not found
tr: %s dosya bulunamadı

source: Department
tr: Birim

source: Departments
tr: Birimler

source: Name
tr: Ad

source: Title
tr: Ünvan

source: Titles
tr: Ünvanlar

source: Staff Type
tr: Personel Tipi

source: Staff Types
tr: Personel Tipleri

source: Person
tr: Kişi

source: Registration Number
tr: Sicil No

source: Start Date
tr: Başlama Tarihi

source: Finish Date
tr: Bitiş Tarihi

source: Status
tr: Durum

source: Employment Agreement
tr: İş Sözleşmesi

source: Statement of Insured Employment
tr: SGK İşe Giriş Bildirgesi

source: Staff
tr: Personel

source: Staffs
tr: Personeller

source: Passive Reason
tr: Pasif Nedeni

source: Passive Reasons
tr: Pasif Nedenleri

source: Passive Staff Event
tr: Pasif Personel Olayı

source: Passive Staff Events
tr: Pasif Personel Olayları

source: Dismiss Reason
tr: İhraç Nedeni

source: Dismiss Reasons
tr: İhraç Nedenleri

source: Dismiss Staff Log
tr: İhraç Personel Günlüğü

source: Dismiss Staff Logs
tr: İhraç Personel Günlükleri

source: Active Reason
tr: Aktif Nedeni

source: Active Reasons
tr: Aktif Nedenleri

source: Active Staff Log
tr: Aktif Personel Günlüğü

source: Active Staff Logs
tr: Aktif Personel Günlükleri

source: the start date the bank holiday becomes official
tr: resmi tatilin, resmi hale geldiği tarih

source: the date of the abolition of the bank holiday
tr: resmi tatilin kaldırıldığı tarih

source: the first day of holiday
tr: tatilin ilk günü

source: one day after the last day of holiday
tr: tatilin son gününden bir gün sonrası

source: And Later
tr: Ve Sonrası

source: required
tr: zorunlu

source: Incorrect type. Expected a dict, but got %s
tr: Hatalı tip. dict tipi beklenirken %s tipi geldi

source: must be number
tr: sayı olmalı

source: must be bigger than or equal 0
tr: sıfırdan büyük yada eşit olmalı

source: must be bigger than or equal zero
tr: sıfırdan büyük yada eşit olmalı

source: must be bigger than 0
tr: sıfırdan büyük olmalı

source: must be bigger than start year(%(v)d)
tr: başlangıç yılından(%(v)d) büyük olmalı

source: %(y1)d - %(y2)d Years; %(duration)d
tr: %(y1)d - %(y2)d Yıl; %(duration)d

source: %(y1)d Years and beyond; %(duration)d
tr: %(y1)d Yıl ve sonrası; %(duration)d

source: Periods
tr: Dönemler

source: Duration Type
tr: Süre Tipi

source: Forward Next Year
tr: Sonraki Yıla Devir

source: Forward Year
tr: Sonraki Yıla Kaç Yıl Devrediyor

source: Created Time
tr: Oluşturulma Zamanı

source: Created User
tr: Oluşturan Kullanıcı

source: Updated Time
tr: Güncellenme Zamanı

source: Updated User
tr: Güncelleyen Kullanıcı

source: Anything other than the finish date of active registrations cannot be changed
tr: Aktif kayıtların bitiş tarihi dışında hiçbir alanı değiştirilemez.

source: expired records cannot be changed in any way
tr: Geçmiş kayıtlar hiçbir şekilde değiştirilemez

source: bigger than today
tr: Bugünden sonraki bir tarih olmalı

source: bigger than start date(%(date)s)
tr: Başlama tarihinden(%(date)s), sonraki bir tarih olmalı

source: must not be set year
tr: yıl girilemez

source: must be set a year
tr: yıl girilmeli

source: must be equal to %(p)d. period's finish year(%(year)d)
tr: %(p)d. dönemin bitiş yılına(%(year)d) eşit olmalı

source: Conflicts with the dates(%(date1)s - %(date1)s) of record #%(id)s
tr: #%(id)s nolu kaydın tarihleri(%(date1)s - %(date1)s) ile çakışıyor

source: Conflicts with the dates(%(date1)s and later) of record #%(id)s
tr: #%(id)s nolu kaydın tarihleri(%(date1)s ve sonrası) ile çakışıyor

source: Contains with the dates(%(date1)s - %(date2)s) of record #%(id)s
tr: #%(id)s nolu kaydın tarihlerini(%(date1)s - %(date2)s) kapsıyor

source: The start date(%(date1)s) of record #%(id)did, conflicts with the entered dates
tr: #%(id)d nolu kaydın başlangıç tarihi(%(date1)s), girilen tarihlerle çakışıyor

source: Contains with the dates(%(date1)s and later) of record #%(id)s
tr: #%(id)s nolu kaydın tarihlerini(%(date1)s ve sonrası) kapsıyor

source: must be greater than start date(%(date)s)
tr: başlama tarihinden(%(date)s), sonraki bir tarih olmalı

source: must be less than or equal %(day)d
tr: %(day)d sayısına eşit veya küçük olmalı

source: %(day_month)s is already a bank holiday
tr: %(day_month)s zaten resmi tatil olarak eklenmiş

source: must be a number
tr: Sayı olmalı

source: bigger than zero
tr: Sıfırdan büyük olmalı

source: less than 25
tr: 25'den küçük olmalı

source: Incorrect time format. Expected `%H:%M`
tr: Hatalı zaman formatı. Format `%H:%M` olmalı

source: Monday
tr: Pazartesi

source: Tuesday
tr: Salı

source: Wednesday
tr: Çarşamba

source: Thursday
tr: Perşembe

source: Friday
tr: Cuma

source: Saturday
tr: Cumartesi

source: Sunday
tr: Pazar

source: required a day at least
tr: En az bir gün gerekli

source: bigger than or equal %(time)s
tr: %(time)s saatinden büyük veya eşit olmalı

source: for this shift type, only sunday shift can be entered
tr: Bu vardiya tipi için sadece pazar günü mesai girilebilir

source: for this shift type, only holiday days can be entered
tr: Bu vardiya tipi için sadece tatil günleri mesai girilebilir

source: this shift type cannot be used on holidays
tr: Bu vardiya tipi için tatil güleri mesai girilemez

source: this shift type cannot be used on sunday
tr: Bu vardiya tipi için pazar günü mesai girilemez

source: staff who has %(identity)s identity, %(name)s %(last_name)s names, conflict with individual shift which has #%(id)d no. Conflicting shift's dates are %(date1)s - %(date2)s
tr: %(identity)s kimliğine sahip, %(name)s %(last_name)s adlı personelin, #%(id)d no'lu bireysel vardiyası ile çakışıyor. Çakışan vardiyanın tarihleri: %(date1)s - %(date2)s

source: staff who has with %(identity)s identity, %(name)s %(last_name)s named, individual shift which has #%(id)d ID, is covered. Shift's covered dates: %(date1)s to %(date2)s
tr: %(identity)s kimliğine sahip, %(name)s %(last_name)s adlı personelin, #%(id)d no'lu bireysel vardiyasının tarihlerini kapsamaktadır. Kapsanan vardiyanın tarihleri: %(date1)s - %(date2)s

source: Work Hour
tr: Çalışma Saati

source: Shift Type
tr: Vardiya Tipi

source: not found
tr: Bulunamadı

source: must be less than %(hour)d
tr: %(hour)d saatinden küçük olmalı

source: Period Start Date
tr: Vardiya Dönemi Başlama Tarihi

source: Period Finish Date
tr: Vardiya Dönemi Bitiş Tarihi

source: Period Duration
tr: Vardiya Dönemi

source: Business Days
tr: Mesai Günleri

source: Shift No
tr: Vardiya No

source: must fall on monday
tr: Pazartesi gününden başlamalı

source: must be %(no)d
tr: %(no)d olmalı

source: bigger than %(time)s
tr: %(time)s saatinden sonraki bir saat olmalı

source: There are %(count)d joint staff both in this shift and in the shift named %(shift_name)s. Unable to edit because the dates of these two shifts overlap
tr: Hem bu vardiyada hem de %(shift_name)s adlı vardiyada, %(count)d müşterek personel bulunmaktadır. Bu iki vardiyanın tarihleri çakıştığı için düzenlenemiyor

source: No action can be taken for an out-of-date shift rule
tr: Güncel olmayan bir vardiya kuralı için herhangi bir işlem yapılamaz

source: The shift number should have the these values; %(values)s
tr: Vardiya numarası şu değerlere sahip olmalıdır; %(values)s

source: Staff who %(identity)s identity, named %(name)s %(last_name)s, are already registered in the %(shift_no)d. shift no of this shift.
tr: %(identity)s kimlik nolu, %(name)s %(last_name)s adlı personel, aynı vardiya kuralında %(shift_no)d nolu vardiyaya kayıtlı.

source: Staff who %(identity)s identity, named %(name)s %(last_name)s, is registered to the shift named %(registered_shift_name)s. the dates of this shift conflict with the dates of the shift named %(new_shift_name)s
tr: %(identity)s kimlik nolu, %(name)s %(last_name)s adlı personelin kayıtlı olduğu %(registered_shift_name)s adlı vardiya ile %(new_shift_name)s adlı vardiya kuralının tarihleri çakışıyor

source: Shift Rule
tr: Vardiya Kuralı

source: Department ID
tr: Birim ID

source: Title ID
tr: Ünvan ID

source: Staff Type ID
tr: Personel Tipi ID

source: Status Code
tr: Durum Kodu

source: Person ID
tr: Kişi ID

source: Required for inactive staff
tr: Pasif personel için gerekli

source: Not required for active staff
tr: Aktif personel için gerekli değil

source: Statement of insured employment of staff who has identity number %(identity)s and register number %(register_no)s and name %(name)s %(last_name)s
tr: %(identity)s kimlik numarası ve %(register_no)s sicil numarası ve %(name)s %(last_name)s adlı personelin SGK şe giriş bildirgesi

source: Employment agreement of staff who has identity number %(identity)s and register number %(register_no)s and name %(name)s %(last_name)s
tr: %(identity)s kimlik numarası ve %(register_no)s sicil numarası ve %(name)s %(last_name)s adlı personelin iş sözleşmesi

source: Active Reason ID
tr: Aktif Nedeni ID

source: Staff is active
tr: Personel aktif

source: Staff ID
tr: Personel ID

source: Active ID
tr: Aktif ID

source: Active Date
tr: Aktif Tarihi

source: Detail
tr: Detay

source: Dismiss Reason ID
tr: İhraç Neden ID

source: Staff is dismiss
tr: Personel zaten ihraç edilmiş

source: Dismiss ID
tr: İhraç ID

source: Dismiss Date
tr: İhraç Tarihi

source: Leave Type ID
tr: İzin Tipi ID

source: Leave Type
tr: İzin Tipi

source: Staff is passive
tr: Personel pasif

source: If leave type is annual leave, not required
tr: İzin türü yıllık izin ise gerekli değildir

source: If leave type is not annual leave, required
tr: İzin türü yıllık izin değil ise gereklidir

source: It should be in 15-minute periods
tr: 15'er dakikalık periyotlar halinde olmalı

source: It should be hourly
tr: Tam saat olmalı

source: Bigger than %(dt)s
tr: %(dt)s tarihinden sonraki bir tarih olmalı

source: Bigger than today
tr: Bugünden sonraki bir tarih olmalı

source: The start date cannot be changed because the leave has started
tr: Başlangıç tarihi değiştirilemez, çünkü izin başlamış

source: The finish date cannot be changed because the leave has finished
tr: Bitiş tarihi değiştirilemez, çünkü izin bitmiş

source: There is conflict with another leave date(%(leave_type)s %(date1)s - %(date2)s)
tr: Başka bir izin tarihi ile çakışma var(%(leave_type)s %(date1)s - %(date2)s)

source: the start date of each working year, based on the employment date of the staff
tr: personelin işe alınma tarihine göre her çalışma yılının başlangıç tarihi

source: 1 year after the starting date of the period of the staff
tr: Personelin o dönem için, görev süresinin başladığı tarihten 1 yıl sonra

source: vested annual leave entitlement at period
tr: dönemde kazanılmış yıllık izin hakkı

source: annual leave used at period
tr: dönemde kullanılan yıllık izin

source: annual leave unused at period
tr: dönemde kullanılmayaan yıllık izin

source: working time of the staff as year
tr: personelin yıl olarak çalışma süresi

source: total leave entitlement at the end of the period, with any past unused leaves
tr: geçmiş kullanılmayan izinlerle birlikte dönem sonundaki toplam izin hakkı

source: which annual leave rule is subject to at that period
tr: o dönemde hangi yıllık izin kuralına tabidir

source: Passive Reason ID
tr: Pasif Nedeni ID

source: Staff is not active
tr: Personel aktif değil

source: Passive Log ID
tr: Pasif Günlük ID

source: Passive Date
tr: Pasif Tarihi

source: Start Working Time
tr: Mesai Başlama Zamanı

source: Finish Working Time
tr: Mesai Bitiş Zamanı

source: Working Type
tr: Mesai Tipi

source: Staff Start Working Time
tr: Personelin İşe Başlama Zamanı

source: Staff Finish Working Time
tr: Personelin İşten Çıkış Zamanı

source: Late Duration
tr: Geciktiği Süre

source: There is a general business rule conflict after this merge.
tr: Bu birleştirme işleminden sonra, genel iş kuralı tarihlerinde çakışmalar oluştu.

source: Business rule id #%(id1)d(%(date_range1)s) conflicts with business rule id #%(id2)d(%(date_range2)s)
tr: #%(id1)d ID nolu genel iş kuralı ile(%(date_range1)s), #%(id2)d ID nolu genel iş kuralının(%(date_range2)s) tarihleri çakışıyor

source: There is a annual leave rule conflict after this merge.
tr: Bu birleştirme işleminden sonra, yıllık izin kuralı tarihlerinde çakışmalar oluştu.

source: Annual leave rule id #%(id1)d(%(date_range1)s) conflicts with annual leave rule id #%(id2)d(%(date_range2)s)
tr: #%(id1)d ID nolu yıllık izin kuralı ile(%(date_range1)s), #%(id2)d ID nolu yıllık izin kuralının(%(date_range2)s) tarihleri çakışıyor

source: Count
tr: Sayı

source: Gender
tr: Cinsiyet

source: Blood Group
tr: Kan Grubu

source: Education Status
tr: Eğitim Durumu

source: Province Name
tr: İl Adı

source: active record can not be deleted
tr: Aktif kayıt silinemez

source: outdated record can not be deleted
tr: Geçmiş kayıt silinemez

source: Those before %(date)s cannot be deleted
tr: %(date)s tarihinden önceki kayıtlar silinemez

source: Conflicts detected on %(count)d shift times
tr: %(count)d tane mesai saati çakışması algılandı

source: Staff named %(name)s %(last_name)s with ID number %(identity)s,
tr: %(name)s %(last_name)s adlı ve %(identity)s kimlik nolu personel,

source: working hours depending on the shift rule name %(name)s(%(date1)s - %(date2)s)
tr: %(name)s adlı vardiya kuralına bağlı olan çalışma saatleri(%(date1)s - %(date2)s)

source: with
tr: ile

source: working hours depending on the individual shift id #%(id)d(%(date1)s - %(date2)s)
tr: #%(id)d id nolu özel vardiyasına bağlı olan çalışma saatleri(%(date1)s - %(date2)s)

source: overlap
tr: çakışıyor

source: working hours depending on the general business rule name %(name)s(%(date1)s - %(date2)s)
tr: %(name)s adlı genel iş kuralına bağlı çalışma saatleri (%(date1)s - %(date2)s)

source: This leave type can not be deleted
tr: Bu izin tipi silinemez

source: shift rule model with this name already exists.
tr: Bu isimde başka bir vardiya kuralı var

source: Paginate departments
tr: Birimleri sayfala

source: Create a department
tr: Birim ekle

source: Update a department
tr: Birim güncelle

source: Delete a department
tr: Birim sil

source: Merge bulk departments
tr: Birimleri birleştir

source: Paginate titles
tr: Ünvanları sayfala

source: Create a title
tr: Ünvan ekle

source: Update a title
tr: Ünvan güncelle

source: Delete a title
tr: Ünvan sil

source: Merge bulk titles
tr: Ünvanları birleştir

source: Paginate staff types
tr: Personel tiplerini sayfala

source: Create a staff type
tr: Personel tipi ekle

source: Update a staff type
tr: Personel tipi güncelle

source: Delete a staff type
tr: Personel tipi sil

source: Merge staff types
tr: Personel tiplerini birleştir

source: Paginate staffs
tr: Personelleri sayfala

source: Send bulk emails to staff
tr: Personele toplu email gönder

source: Send bulk sms to staff
tr: Personele toplu sms gönder

source: Create a staff
tr: Personel ekle

source: Update a staff
tr: Personel güncelle

source: Create a passive reason
tr: Pasifleştirme nedeni ekle

source: Update a passive reason
tr: Pasifleştirme nedeni güncelle

source: Delete a passive reason
tr: Pasifleştirme nedenisil

source: Paginate passive reasons
tr: Pasifleştirme nedenlerini sayfala

source: Merge passive reasons
tr: Pasifleştirme nedenlerini birleştir

source: Make a staff passive
tr: Personeli pasifleştir

source: Paginate passive staff logs
tr: Personel pasifleştirme günlüklerini sayfala

source: Create a dismiss reason
tr: İhraç nedeni ekle

source: Update a dismiss reason
tr: İhraç nedeni güncelle

source: Delete a dismiss reason
tr: İhraç nedeni sil

source: Paginate dismiss reasons
tr: İhraç nedenlerini sayfala

source: Merge dismiss reasons
tr: İhraç nedenlerini birleştir

source: Dismiss a staff
tr: Personeli ihraç et

source: Paginate dismiss staff logs
tr: Personel ihraç günlüklerini sayfala

source: Create a active reason
tr: Aktifleştirme nednei ekle

source: Update a active reason
tr: Aktifleştirme nedeni güncelle

source: Delete a active reason
tr: Aktifleştirme nedeni sil

source: Paginate active reasons
tr: Aktifleştirme nedenlerini sayfala

source: Merge active reasons
tr: Aktifleştirme nedenlerini birleştir

source: Make a staff active
tr: Personeli aktifleştir

source: Paginate active staff logs
tr: Personel aktifleştirme günlüklerini sayfala

source: Create a bank holiday
tr: Resmi tatil ekle

source: Update a bank holiday
tr: Resmi tatil güncelle

source: Delete a bank holiday
tr: Resmi tatil sil

source: Paginate bank holidays
tr: Resmi tatilleri sayfala

source: Create a holiday
tr: Tatil ekle

source: Update a holiday
tr: Tatil güncelle

source: Delete a holiday
tr: Tatil sil

source: Paginate holidays
tr: Tatilleri sayfala

source: Create a business day
tr: Mesai günü ekle

source: Update a business day
tr: Mesai günü güncelle

source: Delete a business day
tr: Mesai günü sil

source: Paginate business days
tr: Mesai günlerini sayfala

source: Create a annual leave rule
tr: Yıllık izin kuralı ekle

source: Update a annual leave rule
tr: Yıllık izin kuralı güncelle

source: Delete a annual leave rule
tr: Yıllık izin kuralı sil

source: Paginate annual leave rules
tr: Yıllık izin kurallarını sayfala

source: Paginate leave types
tr: İzin tiplerini sayfala

source: Create a leave type
tr: İzin tipi ekle

source: Update a leave type
tr: İzin tipi güncelle

source: Delete a leave type
tr: İzin tipi sil

source: Create a shift rule
tr: Vardiya kuralı ekle

source: Update a shift rule
tr: Vardiya kuralı güncelle

source: Delete a shift rule
tr: Vardiya kuralı sil

source: Paginate shift rules
tr: Vardiya kuralalrını satfala

source: Assign shift rule to bulk staff
tr: Vardiyaya toplu personel ata

source: Assigns bulk staffs to the selected shift
tr: Seçili vardiyaya, toplu personel atar

source: Remove staff from shift rule
tr: Personeli vardiyadan çıkar

source: Paginate staffs who depends on shift rule
tr: Vardiyaya bağlı personelleri sayfala

source: Create bulk custom shift
tr: Toplu özel vardiya ekle

source: Delete a custom shift
tr: Özel vardiya sil

source: Paginate custom shifts
tr: Özel vardiyaları sayfala

source: List devices(Staff Module)
tr: Personel modülündeki cihazları listele

source: Change a device status(Staff Module)
tr: Personel modülündeki cihazın durumunu değiştir

source: The device can be active or passive
tr: Cihaz aktif yada pasif yapılabilir

source: Create a device(Staff Module)
tr: Personel modülünde cihaz ekle

source: Update a device(Staff Module)
tr: Personel modülündeki cihazı güncelle

source: List device events(Staff Module)
tr: Personel modülündeki cihazların olay günlüklerini sayfala

source: List person's device permissions(Staff Module)
tr: Personellerin cihaz yetkilerini listele

source: Assign device permission to bulk staff(Staff Module)
tr: Personellere cihaz yetkilerini ata

source: Paginate person's attendance logs(Staff Module)
tr: Personellerin cihaz günlüklerini sayfala

source: Create a staff leave
tr: Personel izni ekle

source: Update a staff leave
tr: Personel izni güncelle

source: Delete a staff leave
tr: Personel izni sil

source: Paginate staff leaves
tr: Personel izinlerini sayfala

source: Paginate absentee staff on date
tr: Verilen tarihde gelmeyen personelleri sayfala

source: Paginate late staff on date
tr: Verilen tarihde geciken personelleri sayfala

source: List annual leave report that belongs to staff
tr: Personele ait yıllık izin raporu listele

source: Staff-Gender statistic paginate
tr: Personel-Cinsiyet istatistiğini sayfala

source: Staff-Blood statistic paginate
tr: Personel-Kan Grubu istatistiğini sayfala

source: Staff-Education statistic paginate
tr: Personel-Eğitim Durumu istatistiğini sayfala

source: Staff-Register Province statistic paginate
tr: Personel-Kütüğe Bağlı İl istatistiğini sayfala

source: Staff-Department statistic paginate
tr: Personel-Birim istatistiğini sayfala

source: Staff-Staff Type statistic paginate
tr: Personel-Personel Tipi istatistiğini sayfala

source: Staff-Title statistic paginate
tr: Personel-Ünvan istatistiğini sayfala

source: Shift type list
tr: Vardiya tiplerini listele

source: Code
tr: Kod

source: Explanation
tr: Açıklama

source: This application provides opportunities such as recording all personal and registration information of employees in a corporate company, leave tracking, report, entry-exit times, overtime information.
tr: Bu uygulama, kurumsal bir şirkette çalışanların tüm kişisel ve sicil bilgilerinin kayıt altına alınması, izin, rapor, giriş-çıkış saatleri, fazla mesai gibi bilgilerin takibini sağlar.

source: Staff Application
tr: Personel Uygulaması

source: Auth Application
tr: Kullanıcı Uygulaması

source: Sms Application
tr: Sms Uygulaması
