Repository: pypi-data/pypi-mirror-136
Catalog: packages/collective.sendinblue/collective.sendinblue-2.0.1.tar.gz/collective.sendinblue-2.0.1/src/collective/sendinblue/locales/*/LC_MESSAGES/collective.sendinblue.po
Languages: es

source: ${mail_plan_plan_type} &mdash; credits : ${mail_plan_credits} (${mail_plan_credit_type})
es: ${mail_plan_plan_type} &mdash; créditos : ${mail_plan_credits} (${mail_plan_credit_type})

source: ${sms_plan_plan_type} &mdash; credits : ${sms_plan_credits} (${sms_plan_credit_type})
es: ${sms_plan_plan_type} &mdash; créditos : ${sms_plan_credits} (${sms_plan_credit_type})

source: API Key
es: Clave API

source: Account
es: Cuenta

source: Account key:
es: Clave de cuenta:

source: Add Sendinblue Portlet
es: Añadir Portlet Sendinblue

source: Add redirect Sendinblue Portlet
es: Añadir redireccionamiento de Portlet Sendinblue

source: Address:
es: Dirección:

source: An error occured while triyng to subscribe to the newsletter
es: Se produjo un error durante la suscripción al boletín

source: Archive link
es: Enlace de archivos

source: Base url of the registration form to redirect to
es: URL base del formulario de registro para redirigir

source: Base url to redirect to
es: URL base para redirigir

source: City:
es: Ciudad:

source: Company:
es: Compañía:

source: Country:
es: País:

source: Date created
es: Fecha de creación

source: Description of the rendered portlet
es: Descripción que aparecerá en el portlet

source: Edit Sendinblue Portlet
es: Editar Portlet Sendinblue

source: Edit redirect Sendinblue Portlet
es: Editar redireccionamiento de Portlet Sendinblue

source: Email address
es: Dirección de correo electrónico

source: Email:
es: Correo electrónico:

source: First name:
es: Nombre:

source: Key
es: Clave

source: Last name:
es: Apellido:

source: Link to a page where you store previous newsletters
es: Enlace a una página donde almacena boletines anteriores

source: List
es: Lista

source: Mail plan:
es: Plan de correo:

source: Name
es: Nombre

source: Others informations and descriptions
es: Otras informaciones y descripciones

source: Please check the captcha to prove you're a human
es: Haga clic en el CAPTCHA para demostrar que no es un robot

source: Portlet description
es: Descripción del portlet

source: Portlet header
es: Título del portlet

source: SMS plan:
es: Plan SMS:

source: Select list to enable subscriptions to
es: Seleccione la lista a la que los usuarios pueden suscribirse

source: Sendinblue API Key(s)
es: Clave(s) de API Sendinblue

source: Sendinblue Account(s)
es: Cuenta(s) Sendinblue

source: Sendinblue Lists
es: Listas Sendinblue

source: Sendinblue integration for Plone
es: Integración de Sendinblue para Plone

source: Sendinblue integration for Plone.
es: Integración de Sendinblue para Plone.

source: Sendinblue settings
es: Configuraciones Sendinblue

source: Site Setup
es: Configuración del Sitio

source: Standard
es: Configuración

source: Subscribe
es: Inscribirse

source: Text
es: Texto

source: This portlet displays a redirect form to a Sendinblue list subscribe form.
es: Este portlet muestra un formulario de redireccionamiento a un formulario de suscripción a la lista Sendinblue.

source: This portlet displays a subscription form for a Sendinblue newsletter.
es: Este portlet muestra un formulario de suscripción para un boletín de Sendinblue.

source: Title of the rendered portlet
es: Título que aparecerá en el portlet

source: Total subscribers
es: Número total de suscriptores

source: Value
es: Valor

source: You are successfully subscribed to the newsletter !
es: ¡Estás suscrito al boletín!

source: Zip:
es: Código postal:

source: archives
es: Archivos

source: help_api_keys
es: Ingrese su clave Sendinblue aquí. Si tiene varias cuentas de Sendinblue, puede ingresar una clave por línea. Inicie sesión en https://account.sendinblue.com/advanced/api y copie la clave API en este campo.

source: help_email
es: Por favor, ingrese su dirección de correo electrónico.

source: msg_sendinblue_no_account
es: No tiene una cuenta válida vinculada al sitio en este momento.
