#!/usr/bin/env python
# -*- coding: utf-8 -*-
#
# Python API / v4yve.corp
# v4yve-api.py
# VK: https://vk.com/v4yve

class v4APIError(Exception):
  pass


class ArgumentError(Exception):
  pass


class InvalidTokenError(Exception):
  pass


class OverridingEx(Exception):
  pass

class SCodeEx(object):
  
  def __init__(self, code):
    self.code = code
    print("Code получен")
  
  def __raise__(self):
    code = self.code
    codes = {
      # Клиентские
      400:"'400 Плохой запрос'. Сервер не понимает запрос из-за неверного синтаксиса. ",
      401:"'401 Неавторизованно'. Для получения запрашиваемого ответа нужна аутентификация.",
      403:"'403 Запрещено'. У клиента нет прав доступа к содержимому, сервер отказывается дать надлежащий ответ. ",
      404:"'404 Не найден'. Сервер не может найти запрашиваемый ресурс.",
      405:"'405 Метод не разрешён'. Сервер знает о запрашиваемом методе, но он был деактивирован и не может быть использован.",
      407:"407 Этот код ответа аналогичен коду 401, аутентификация требуется для прокси сервера.",
      408:"408 Сервер отключил неиспользуемое соединение",
      # Северные
      502:"'502 Плохой шлюз'. Сервер получил недействительный (недопустимый) ответ."
    }
    print(codes[code])